20240501T165757--kdoc-152-dependabotが作ったprでワークフローが失敗する理由__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 152: Dependabotが作ったPRでワークフローが失敗する理由</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 152: Dependabotが作ったPRでワークフローが失敗する理由</h1>

<div id="outline-container-orgcebeb24" class="outline-2">
<h2 id="orgcebeb24"><a href="#orgcebeb24">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgcebeb24">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd74e394" class="outline-2">
<h2 id="orgd74e394"><a href="#orgd74e394">概要</a></h2>
<div class="outline-text-2" id="text-orgd74e394">
<p>
Dependabotは、<a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a>で、自動で依存ライブラリを更新する機能である。Dependabotによって作られるPull Requestで常にテストが失敗しているのを認識し、理由がわかったのでメモする。
</p>
</div>
</div>
<div id="outline-container-org3c80114" class="outline-2">
<h2 id="org3c80114"><a href="#org3c80114">理由</a></h2>
<div class="outline-text-2" id="text-org3c80114">
<p>
結論からいうと、ドキュメントにある。
</p>

<blockquote>
<p>
Dependabot pull request によってトリガーされるワークフロー実行は、フォークされたリポジトリからのものであるかのように実行されるため、読み取り専用の GITHUB_TOKEN を使用します。 それらのワークフローの実行は、シークレットにはアクセスできません。 これらのワークフローをセキュリティで保護するための戦略については、「GitHub Actions のセキュリティ強化」を参照してください。
</p>
<ul class="org-ul">
<li><a href="https://docs.github.com/ja/actions/security-guides/automatic-token-authentication#permissions-for-the-github_token">自動トークン認証 - GitHub Docs</a></li>
</ul>
</blockquote>

<p>
Dependabotが作るPull Requestで実行失敗していたのは、Dockerイメージレジストラにイメージをpushするタスクだった。このタスクでは、レジストラにイメージをpushするのに強い権限のトークンが必要なため、シークレットにトークンを登録していた。Dependabotが作るPull Requestではこのシークレットにアクセスできず、ログインジョブで失敗して終了していた。
</p>

<p>
意識したことはなかったが、この挙動になっていることで、Publicリポジトリでも安全を保てるようになっている。
</p>
</div>
</div>

<div id="outline-container-orge16fa7c" class="outline-2">
<h2 id="orge16fa7c"><a href="#orge16fa7c">関連</a></h2>
<div class="outline-text-2" id="text-orge16fa7c">
<ul class="org-ul">
<li><a href="20240430T183500--kdoc-147-github-tokenを使ってgit-pushするとトリガーされない__code.html#ID-20240430T183500">KDOC 147: GITHUB_TOKENはトリガー権限を持っていない</a>。GitHub Actionsのデフォルトトークンの権限まわりの話</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
